[{"ScholarshipName": "Pence Construction Diversity in Leadership Scholarship", "Organization": "Oregon Community Foundation - Portland \n1221 SW Yamhill St., Ste. 100Portland, OR", "Phone Number": "(503)227-6846", "Emails": "info@oregoncf.org", "Level of Study": "Bachelor's Degree  Vocational", "Award Type": "Scholarship", "Purpose": "To support underrepresented students of color pursuing postsecondary education in construction engineering.", "Focus": "Construction.", "Qualifications": "Applicants must be underrepresented students of color majoring in construction engineering at an institution of higher education in Oregon,", "Criteria": "Preference is given to Multnomah County residents.", "Duration": "Annual.", "To Apply": "Application is available online.", "Deadline": "March 1.", "Contact": "Email: scholarships@oregoncf.org; URL: oregoncf.org/grants-and-scholarships/scholarships/.", "For more information": "http://oregoncf.org/"}, {"ScholarshipName": "Carpenters' Company Scholarship Program", "Organization": "Carpenters' Company of the City and County of Philadelphia \n320 Chestnut St., Carpenters HallPhiladelphia, PA 19106", "Phone Number": "(215)925-0167", "Emails": "carphall@carpentershall.com", "Level of Study": "Bachelor's Degree", "Award Type": "Scholarship", "Purpose": "To provide architecture, structural engineering, or construction management/engineering.", "Focus": "Architecture; Construction; Engineering, Architectural.", "Funds": "$5,000", "Duration": "Annual; up to 4 years.", "To Apply": "Applicants must submit a completed scholarship application form.", "For more information": "http://www.carpentershall.org"}, {"ScholarshipName": "PC Construction Scholarship", "Organization": "Vermont Student Assistance Corporation \n10 E Allen St.Winooski, VT 05404", "Phone Number": "(800)642-3177", "Emails": "info@vsac.org", "Level of Study": "Bachelor's Degree", "Award Type": "Scholarship", "Purpose": "To support a Vermont graduating senior pursuing a degree in construction management or civil/mechanical engineering.", "Focus": "Construction; Engineering, Civil; Engineering, Mechanical.", "Qualifications": "Applicant must be a Vermont resident; current high school senior; must be seeking an undergraduate degree in construction management or civil/mechanical engineering at an accredited school; must be enrolled full-time and have financial need; must demonstrate academic achievement and a strong work ethic.", "Criteria": "Selection is based on financial need, essay, academic achievement, and recommendation letter.", "Funds": "$2,500", "Duration": "Annual.", "Number of Awards": "1.", "To Apply": "Applicant must submit a completed application form, completed FAFSA, recommendation letter, essay, and official transcript.", "Deadline": "February 11.", "Contact": "Email: scholarships@vsac.org; URL: www.vsac.org/vsacscholarships.", "For more information": "http://www.vsac.org"}, {"ScholarshipName": "Maryland Building Industry Association, Eastern Shore Chapter", "Organization": "Community Foundation of the Eastern Shore, Inc. \n1324 Belmont Ave., Ste. 401Salisbury, MD 21804", "Phone Number": "(410)742-9911", "Level of Study": "Bachelor's Degree  Vocational", "Award Type": "Scholarship", "Purpose": "To encourage and support Eastern Shore students who are pursuing careers in architecture, engineering, or a construction related study.", "Focus": "Architecture; Construction; Engineering.", "Qualifications": "Applicants must be current graduating seniors of high schools in the Eastern Shore of Maryland counties of Kent, Queen Anne's, Caroline, Talbot, Dorchester, Somerset, and Worcester; must have been accepted into an accredited four-year college or postsecondary training institution; must be enrolled in the fields of architecture, engineering, or construction-related studies; must have a minimum 2.5 GPA and have participated in extracurricular activities.", "Criteria": "Recipients are selected based on academic performance, financial need, and extracurricular activities (community activities or work from employment may be considered appropriate substitutes for extracurricular activities).", "Funds": "$500", "Duration": "Annual.", "To Apply": "Applicants must submit a completed application form; official high school transcript of grades; letter of acceptance from college or university; an essay describing the reasons of choosing the career path; and two letters of recommendation from non-family members.", "Deadline": "April 1.", "Contact": "Home Builders Association of Maryland, Eastern Shore Chapter Scholarship, 11825 W. Market Place, Fulton, MD, 20759; Email: ScholarshipAccept@cfes.org; URL: www.cfes.org/scholarships.", "For more information": "http://www.cfes.org"}, {"ScholarshipName": "JMA Architecture Studios Scholarship", "Organization": "Public Education Foundation \n4350 S Maryland Pky.Las Vegas, NV 89119", "Phone Number": "(702)799-1042", "Emails": "info@thepef.org", "Level of Study": "Bachelor's Degree", "Award Type": "Scholarship", "Purpose": "To provide financial assistance for tuition, fees and other appropriate educational expenses for seniors interested in pursuing a career in architecture and plan to enroll as a full-time student at a university with an accredited School of Architecture.", "Focus": "Architecture.", "Qualifications": "Applicants must be CCSD seniors interested in pursuing a career in architecture and planning to attend a university with an accredited School of Architecture; demonstrate financial need and have a minimum 3.0 unweighted cumulative GPA.", "Criteria": "Preference will be given to students who have participated in the Clark County School District's drafting program and have financial need.", "Funds": "$5,000", "Duration": "Annual.", "Number of Awards": "3.", "To Apply": "Applicants should submit a completed application form together with the following: two letters of recommendation from a teacher, school counselor, club advisor, coach or employer; a copy of letter of admission to a college or university; and upload a work sample or portfolio; resume; current transcript; \"Financial Need Letter\" explaining why you need assistance with your college/school expenses.", "Deadline": "January 31.", "Contact": "Phone: 702-221-7422; Email: csdonnelly@ccpef.org.", "For more information": "http://thepef.org"}]